{
  "backend/main.mo": "Main backend actor implementing a wedding photography/videography platform with portfolio management (videos/photos by category), booking system, package management, user profiles, homepage/sitewide content, special moment galleries, and role-based access control using AccessControl and MixinAuthorization modules.",
  "feature_evidence.json": "Feature evidence report documenting four implemented features: unified admin dashboard page creation, routing configuration updates, AdminGuard component backend integration, and Layout component admin link addition, all with high confidence and mapped to test requirements REQ-27 through REQ-30.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components, pages, and hooks describing the React application structure including routing, admin pages, public pages, reusable components, and React Query hooks for backend integration.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining light and dark theme color schemes using oklch color space for consistent design tokens across the application.",
  "frontend/index.html": "HTML entry point for the React application with viewport meta tag and root div mounting point, loading the main TypeScript module.",
  "frontend/src/App.tsx": "Main application component configuring TanStack Router with all public routes (home, videos, special-moments, booking) and admin routes (dashboard, orders, content, packages, special-moments, homepage, categories, sitewide-content) wrapped with AdminGuard, plus ThemeProvider, ProfileSetup, and Toaster components.",
  "frontend/src/components/admin/BookingActions.tsx": "Admin action buttons for managing bookings including approve/reject, status updates, and photographer assignment via principal ID. Uses dropdown menu and dialog for interactions.",
  "frontend/src/components/admin/BookingTable.tsx": "Table component displaying booking details (customer, email, package, date, status, photographer) with status badges and action buttons for each booking row.",
  "frontend/src/components/admin/CategoryMetaForm.tsx": "Form for editing display names and descriptions for three gallery categories (Weddings, Pre-Wedding, Receptions). Loads current metadata and updates all categories on submit.",
  "frontend/src/components/admin/HomepageContentForm.tsx": "Form for editing homepage hero section content including title, subtitle, button text, and background image upload with progress tracking. Supports image upload via ExternalBlob.",
  "frontend/src/components/admin/MediaGrid.tsx": "Displays a grid of videos or photos with controls to delete items and toggle featured status. Uses alert dialogs for delete confirmation and shows category badges.",
  "frontend/src/components/admin/MediaUploadForm.tsx": "Form component for uploading videos or photos with title, category selection, and file input. Handles file conversion to ExternalBlob and displays upload progress.",
  "frontend/src/components/admin/PackageForm.tsx": "Form for creating or editing service packages with fields for name, description, price, and video/photo type checkbox. Handles BigInt price conversion.",
  "frontend/src/components/admin/PackageList.tsx": "Table view of all packages with edit and delete actions. Opens a dialog with PackageForm for editing and uses alert dialog for delete confirmation.",
  "frontend/src/components/admin/SitewideContentForm.tsx": "Form for editing sitewide text content including services description, booking intro, and footer content. Loads current content from props and updates via mutation.",
  "frontend/src/components/admin/SpecialMomentGalleryForm.tsx": "Form for creating special moment galleries with date, title, description, and photo selection. Displays available photos in a scrollable grid with checkboxes for multi-select.",
  "frontend/src/components/admin/SpecialMomentGalleryList.tsx": "Displays a table of special moment galleries with date, title, description, and photo count. Shows loading spinner or empty state when appropriate.",
  "frontend/src/components/AdminGuard.tsx": "Route guard component that verifies user authentication via Internet Identity and admin status via backend isCallerAdmin query, redirecting non-authenticated users to home and showing access denied alert for authenticated non-admins with loading states during verification.",
  "frontend/src/components/BookingForm.tsx": "A form component for submitting booking requests with fields for customer name, email, package selection, and event date. Uses React Query mutations to create bookings and displays toast notifications for success/error states.",
  "frontend/src/components/CategoryFilter.tsx": "A filter component that displays category buttons (All, Weddings, Pre-Wedding, Receptions) with active state styling. Fetches category metadata from the backend and provides fallback labels if metadata is unavailable.",
  "frontend/src/components/FeaturedGallery.tsx": "Displays featured videos and photos in grid layouts with category badges and hover effects. Shows up to 3 featured videos and 6 featured photos, with a fallback message when no featured content exists.",
  "frontend/src/components/HeroSection.tsx": "A hero section component with customizable title, subtitle, button text, and background image. Features a gradient overlay and two call-to-action buttons for booking and viewing work.",
  "frontend/src/components/Layout.tsx": "Main layout component with sticky header navigation, mobile menu, footer with social links, and conditional admin dashboard access. Integrates authentication state and sitewide content from backend.",
  "frontend/src/components/LoginButton.tsx": "Authentication button component that handles Internet Identity login/logout with loading states. Clears React Query cache on logout and handles authentication errors.",
  "frontend/src/components/PackageCard.tsx": "Displays a photography or videography package in a card format with icon, name, price, description, and selection button. Formats bigint prices and distinguishes between video and photo packages.",
  "frontend/src/components/PhotoCard.tsx": "A photo card component with category badge and hover effects that opens a full-size image in a dialog when clicked. Displays photo title and converts category codes to readable labels.",
  "frontend/src/components/ProfileSetup.tsx": "A modal dialog that prompts authenticated users without profiles to enter their name and email. Prevents dismissal until profile setup is complete and uses React Query to save profile data.",
  "frontend/src/components/SpecialMomentGalleryCard.tsx": "Displays a clickable card for a special moment gallery with preview image, title, date, description, and photo count. Includes hover effects and gradient overlays.",
  "frontend/src/components/SpecialMomentGalleryView.tsx": "Modal dialog component that displays all photos within a special moment gallery in a responsive grid layout with gallery title, date, and description.",
  "frontend/src/components/VideoCard.tsx": "Card component that displays a video with native controls, category badge, and title. Includes hover effects and category label mapping.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages an authenticated or anonymous backend actor based on Internet Identity state. Invalidates dependent queries when actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context with login/logout functionality and authentication status tracking. Includes provider component and custom hook for accessing auth state.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including user profiles, videos, photos, packages, bookings, galleries, and content management. Provides both query and mutation hooks with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom wedding photography theme colors (rose-gold, champagne, ivory) in both light and dark modes using OKLCH color space.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the main App component.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard landing page with navigation cards to all admin sections including orders, content, galleries, packages, homepage, categories, and sitewide content management.",
  "frontend/src/pages/admin/CategoryManagementPage.tsx": "Admin page for customizing category metadata including display names and descriptions for gallery categories like Weddings, Pre-Wedding, and Receptions.",
  "frontend/src/pages/admin/ContentManagementPage.tsx": "Admin page with tabbed interface for uploading and managing videos and photos, displaying existing media in grids with upload forms.",
  "frontend/src/pages/admin/HomepageManagementPage.tsx": "Admin page for editing homepage hero section content including title, subtitle, call-to-action button text, and background image.",
  "frontend/src/pages/admin/OrderManagementPage.tsx": "Admin page displaying all bookings organized by status (pending, confirmed, completed, rejected) in tabbed tables with counts.",
  "frontend/src/pages/admin/PackageManagementPage.tsx": "Admin page for creating and managing photography/videography packages with toggleable form and list view of existing packages.",
  "frontend/src/pages/admin/SitewideContentPage.tsx": "Admin page for editing sitewide text content including services description, booking intro, and footer text.",
  "frontend/src/pages/admin/SpecialMomentsManagementPage.tsx": "Admin page for creating and managing date-organized special moment photo galleries with toggleable creation form and gallery list.",
  "frontend/src/pages/BookingPage.tsx": "Booking page displaying photography and videography packages in tabs with package cards and a booking request form. Allows pre-selecting packages.",
  "frontend/src/pages/HomePage.tsx": "Homepage with hero section, services overview (photography/videography cards), and featured galleries for both photos and videos. Uses dynamic content from backend.",
  "frontend/src/pages/SpecialMomentsPage.tsx": "Public-facing page displaying photo galleries filtered by category or organized by date, with toggle between category view (individual photos) and date view (special moment galleries).",
  "frontend/src/pages/VideosPage.tsx": "Public-facing page displaying video portfolio with category filtering, showing video cards in a responsive grid layout.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage integration for cross-navigation persistence.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes (using OKLCH color space), typography, container settings, border radius, shadows, and animations for a cinematic wedding photography theme.",
  "project_state.json": "Project metadata describing a photography/videography booking website with public galleries, customer booking system, and Internet Identity-protected admin panel for managing orders, content, and packages."
}